{"meta":{"title":"Hexo","subtitle":null,"description":null,"author":"John Doe","url":"http://Jinnm.github.io","root":"/"},"pages":[{"title":"All tags","date":"2018-09-11T14:11:11.000Z","updated":"2018-09-11T14:11:58.318Z","comments":true,"path":"tags/index.html","permalink":"http://Jinnm.github.io/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"testn","slug":"testn","date":"2019-05-30T05:01:05.000Z","updated":"2019-05-30T05:02:02.392Z","comments":true,"path":"2019/05/30/testn/","link":"","permalink":"http://Jinnm.github.io/2019/05/30/testn/","excerpt":"","text":"","categories":[],"tags":[]},{"title":"ceshipic","slug":"ceshipic","date":"2019-05-30T02:59:23.000Z","updated":"2019-05-30T03:00:05.930Z","comments":true,"path":"2019/05/30/ceshipic/","link":"","permalink":"http://Jinnm.github.io/2019/05/30/ceshipic/","excerpt":"","text":"","categories":[],"tags":[]},{"title":"Unity Shader转SP","slug":"Unity2SP","date":"2019-05-29T10:59:42.000Z","updated":"2019-05-30T02:38:01.084Z","comments":true,"path":"2019/05/29/Unity2SP/","link":"","permalink":"http://Jinnm.github.io/2019/05/29/Unity2SP/","excerpt":"","text":"前段时间研究了一下怎么把Unity的shader搬到SP，原因是：美术在SP中制作贴图，生成的美术资源放进Unity之后就完全是另一个样子了，来回修改非常麻烦。所以希望SP中就显示引擎里的效果。通过观察sp自带的clay shader1234// - Ambient and diffuse contributiondiffuseShadingOutput((ambient + NdV) * diffuse);// - Specular contributionspecularShadingOutput(vec3(specular * pow(NdV, 64.0 * clayGloss)));发现两点1、这个shader里根本就没有用光照信息（NdV是Normal * View），但是最终的效果可能还是会加上光照信息？只是这部分被隐藏了2、sp的shader提供了一些针对pbr不同通道的接口，但是不知道里面具体做了啥为了弄清楚这两点，尝试一下phong光照模型，只用diffuse和specular，ambient暂时不要。按照clay shader的方法写了一个phong的12345678910111213141516171819202122232425import lib-vectors.glslimport lib-alpha.glslimport lib-pbr.glslimport lib-utils.glsl//- Phong shader//- ===========//: param auto channel_basecoloruniform sampler2D basecolor_tex;//: param custom &#123; &quot;default&quot;: 0.5, &quot;label&quot;: &quot;Specular&quot;, &quot;min&quot;: 0.001, &quot;max&quot;: 1.0 &#125;uniform float specular;//: param custom &#123; &quot;default&quot;: 0.5, &quot;label&quot;: &quot;Glossiness&quot;, &quot;min&quot;: 0.001, &quot;max&quot;: 1.0 &#125;uniform float gloss;//- Entry point of the shader.void shade(V2F inputs)&#123; //- We generate local world space vectors LocalVectors vectors = computeLocalFrame(inputs); //- Simulate camera aligned lighting float NdV = max(0.0, dot(vectors.normal, vectors.eye)); vec3 baseColor = getBaseColor(basecolor_tex, inputs.tex_coord); //- Ambient and diffuse contribution diffuseShadingOutput(NdV * baseColor); //- Specular contribution specularShadingOutput(specular * vec3(pow(NdV, 64.0 * gloss)));&#125;按照这个写法写unity shader，并将颜色空间改为linear（因为SP中是默认Linear）12345678910// ...fixed3 normalizedNormal = normalize(i.worldNormal);fixed3 normalizedViewDir = normalize(i.worldViewDir);float NdV = saturate(dot(normalizedNormal, normalizedViewDir));fixed3 albedo = tex2D(_MainTex, i.uv);fixed3 diffuse = albedo * NdV;fixed3 specular = _Specular * pow(NdV, 64.0 * _Glossness);return fixed4((diffuse + specular), 1);// ...然后发现！几乎完全一样！所以1、ShadingOutput的接口貌似啥也没干，就是最后把几个接口的值相加输出2、SP自带光照可以直接不要，只用自己的光照所以理论上，只要把unity的shader翻译成glsl，并把光照参数手动写进去就好了。来试试看光照。在之前shader的基础上加上光源。UUnity使用一个平行光，SP中使用和Unity中一样的光照参数。12345678fixed3 halfDir = normalize(normalizedLightDir + normalizedViewDir);float NdV = saturate(dot(normalizedNormal, normalizedViewDir));float NdL = saturate(dot(normalizedNormal, normalizedLightDir));float NdH = saturate(dot(normalizedNormal, halfDir));fixed3 albedo = tex2D(_MainTex, i.uv);fixed3 diffuse = albedo * NdL;fixed3 specular = _Specular * pow(NdH, 64.0 * _Glossness);return fixed4((diffuse + specular), 1);12345678910// mainLight的参数做个对外接口，可调节vec3 halfDir = normalize(mainLight.direction + vectors.eye);float NdV = max(0.0, dot(vectors.normal, vectors.eye));float NdL = max(0.0, dot(vectors.normal, mainLight.direction));float NdH = max(0.0, dot(vectors.normal, halfDir));vec3 baseColor = getBaseColor(basecolor_tex, inputs.tex_coord);//- Ambient and diffuse contributiondiffuseShadingOutput(NdL * baseColor);//- Specular contributionspecularShadingOutput(specular * vec3(pow(NdH, 64.0 * gloss)));变换光源方向看看效果，可以发现达到了一致。","categories":[],"tags":[{"name":"Shader","slug":"Shader","permalink":"http://Jinnm.github.io/tags/Shader/"}]},{"title":"摄影 || 胶片X夜景","slug":"photo4","date":"2019-03-30T11:59:25.000Z","updated":"2019-05-29T11:00:34.415Z","comments":true,"path":"2019/03/30/photo4/","link":"","permalink":"http://Jinnm.github.io/2019/03/30/photo4/","excerpt":"","text":"手持傻瓜胶片机拍夜景，想想就很崩啊……不过还是想尝试下，了解一下自己的相机出片之后最大的感受是，闪光灯一打真的很丑，整个画面就死了的感觉","categories":[],"tags":[{"name":"Photography","slug":"Photography","permalink":"http://Jinnm.github.io/tags/Photography/"}]},{"title":"摄影 || DX Code是什么","slug":"photo3","date":"2019-03-25T15:40:39.000Z","updated":"2019-05-30T02:53:00.829Z","comments":true,"path":"2019/03/25/photo3/","link":"","permalink":"http://Jinnm.github.io/2019/03/25/photo3/","excerpt":"","text":"我有两台胶片机，一台是全手动的Olympus om1，还有一台是傻瓜式的Konica kmini，全手动的需要自己调焦调光圈，自己根据胶片调ISO，甚至因为买不到合适电压的测光电池，还要因为电压过大，将ISO调的比胶片本身设定的低，另外也要自己过片自己回卷。习惯了做全套之后，我第一次用傻瓜胶片机的时候，找了半天调节ISO的地方，自动调焦自动过片我都能理解，但是ISO总要自己调吧？因为这主要不是外界景物的问题，而是胶卷本身啊。网上一查才知道原来胶卷上有DX Code这个东西，可以使得相机自动调节ISO。就是胶卷上的这个黑白的方块格（我之前一直以为是装饰！突然想到电影的打板也是这样一块黑一块白的，这么说来很可能也有含义，但没查到，不过查到了理发店门口为什么也有那种黑白相间的东西~）每几个方格1或0的组合表示不同的意思，通过DX Code，相机可以得知胶卷的感光度，可拍张数以及宽容度。","categories":[],"tags":[{"name":"Photography","slug":"Photography","permalink":"http://Jinnm.github.io/tags/Photography/"}]},{"title":"Wireframe without Geometry Shader","slug":"shader3","date":"2019-03-24T07:37:52.000Z","updated":"2019-03-24T07:57:58.777Z","comments":true,"path":"2019/03/24/shader3/","link":"","permalink":"http://Jinnm.github.io/2019/03/24/shader3/","excerpt":"","text":"这篇来讨论一下渲染线框的方法，目前知道的方法有1、在贴图上画2、把线框的模型建出来3、使用geometry shader计算4、使用图形接口的fill mode5、使用pTex，每张贴图是一个线框前两条是美术的方法，要看情况，如果只是单纯的渲染出线框，肯定是希望用程序的方法解决，减少美术工作量，但是有时候对线框的需求有点风格化，比如颜色的渐变，模型起伏大的地方线框粗，这样的话还可能还是美术来做效果更好一些。第3条es是不支持的，第4条没找到unity中的接口，而且es好像也不支持……第5条会因为面片的形状大小对贴图上的线框做拉伸，导致粗细不均匀，不过可以在屏幕空间上做判断来改善这个问题。目前这几个方法，125都可以算美术的方法，34移动端不支持，即OpenGL ES3.1及以下版本支持的，那么有没有不需要gs的计算的方法？最后我自己没想出来，但是在github上找到一个方法，计算代价不大，主要需要额外的uv或模型。https://github.com/miguel12345/UnityWireframeRenderer大致讲一下他的思路：关键在于，重新组织mesh的信息，mesh中有索引数组可以帮助我们组织三角形，取得这个情报后，把它放进顶点的UV，使得shader可以看这个情报。1、在原物体上挂一个新的GameObject，把原mesh的信息放进新的mesh2、复制信息时，做一些手脚：将一个三角形的三个点的UV分别设置为00, 01, 103、于是就可以根据一个点的uv位置知道它在三角形中什么位置了，而且计算到边的距离运算量很小但是很容易发现这样有个问题，uv位置只是一个相对位置，如果给这个比例值限定一个固定的阈值的话，假设一个正方形拉长，那么有两条边会变粗，大小不同的三角形粗细也会不一样。而我们的目的是在最后的像素空间上看起来粗细一样。如何解决这个问题呢？可以使用导数，求得屏幕空间相邻两个像素的uv差值，假设三角形大小是x，uv大小是1，那么导数求得的就是1/x，乘以描边大小假设是3，3/x也是个比例值，就是描边粗细在三角形中的比例，这个值作为uv这个比例值的阈值的话，就不会有变形的问题。实际实现时，要同时考虑u轴v轴两条轴的影响，使得旋转不变形。","categories":[],"tags":[{"name":"Shader","slug":"Shader","permalink":"http://Jinnm.github.io/tags/Shader/"}]},{"title":"描边shader再探讨","slug":"shader2","date":"2019-03-12T13:10:50.000Z","updated":"2019-03-24T05:44:34.439Z","comments":true,"path":"2019/03/12/shader2/","link":"","permalink":"http://Jinnm.github.io/2019/03/12/shader2/","excerpt":"","text":"之前的一篇描边shader只是讲了实现的大致思路，但是实际去实现一个普通的角色描边shader的话，会发现很多很多的问题……普通的描边感觉比较好也比较常用的方式是用两个pass，底下那层在屏幕空间沿法线外扩，且剔除正面，上面那层用普通的。但是真的使用起来会用很多很麻烦的事。一、关于是否只要外轮廓图一为只要外轮廓，图二为中间也要，注意看手，手这个角度在外轮廓中，但也有描边。如果只要外轮廓，轮廓内部的描边不要的话，可以在第一个pass设置ZWrite off，后一个pass就可以严严实实的盖住它，只露出旁边一圈。关闭深度写入很省心但是会有很多问题，比如Geometry之后会有天空盒的渲染，就会把深度未写入的描边给盖住，就需要调整渲染队列，然后又会带来新的问题……这个时候这个做法就已经不经济了。另一个方法是用Offset指令控制深度测试，让后面的描边颜色稍稍靠后一点。但是往后多少呢，少了的话，一部分面片穿插不能解决，多了的话，角色后面有个靠的很近的物体可能就会出问题……而如果要内部描边的话，让一些背面的渲染结果“露出来”，就会因为模型的缘故出现各种奇奇怪怪的问题，严重的比如……即便模型建的比较规范，没有严重的面片穿插问题，也会出现一些描边位置奇怪的问题，比如你会感觉你希望的描边并不是这样的……不过想做到这个要求就比较高了，计算机视觉这方面要做的好都需要复杂得多的算法，比如用双阈值判断是否连接……而且关于哪些地方应该描边有很多主观的因素，想象你自己在一张原画上画，很多地方该不该描也要犹豫。二、关于如何解决面片割裂开就是沿法线外扩的时候，面片会分开，像这样：如果外扩不是很多的话，可以将要外扩的方向和这个点相对于模型中心的方向lerp一下，可以改善一点点……另外有个方法是在导入设置中设置法线为calculate但是这么做一方面比较费，另一方面效果还是要看情况，比如修改前修改后分别是这个效果要效果好一点，目前知道的唯一方法是……让美术改模型……（美术：那你给我做一个工具吧！）三、关于描边是否渐变有些时候需要描边往内渐隐，会有一种发光感第一反应：简单啊，就是另一种描边的方式，根据法线和视线夹角的值加描边，角色的边缘和视线的值差不多是九十度。但是还有另外一个要求，只要外轮廓，中间不要加……如果按之前想的方法，中间所有凸起的地方旁边都会有一圈发光描边，就不符合要求了。第一个想法：第一个pass外扩，第二个pass往内缩一些，然后把第一个pass的渐变限制在露出来的那一截。实际操作的时候，由于露出来的那一截需要比较宽的一段，顶点沿法线移动太多导致很多面片分离以及穿插的问题……第二个想法：用模型空间的坐标做判断，设计一个函数使得，顶点离原点越近，描边影响就越小，同时x轴上的影响更剧烈一些（因为这个shader用在角色上，x轴比较短，y轴比较长）。这样的话，角色一旦是张开手臂的话，手臂上就没有描边了……而且因为头和身子头发都是分开的mesh，也会有问题，随着角色形象的变化还有很多很多问题………总的来说这个方法太过“定制化”了，毫无实用性。第三个想法：一般中间不需要描边的部分离摄影机更近，所以可以计算顶点与摄像机的距离，同时计算模型上的(0, y, 0)点与摄像机的距离，两个距离差值越大，描边越弱。这个效果相对来说还可以。但是也会有很多的问题1、中心即便突出一些，也突出的很少，需要比较高的精度2、不同角色差异会很大3、当角色斜侧着身子就会不符合想要的效果。比如像上图这个角度，最左边的左手和最右边的头发应该是同等的描边效果，然而它们分别是离摄像机最远的一点和最近的一点。四、关于使用后处理其实用后处理很多时候效果会好很多，毕竟发生的很多问题都是3D方面的问题……然而因为后处理太费，尤其是对于移动端，这是一种尽量不要去考虑的方式……后处理的方式就是添加一个额外相机，复制原相机属性，只将需要描边的物体渲染在RT，可以通过layer指定渲染物体。然后将RT扩展出外边，类似高斯模糊，如果不想要渐变的描边效果可以做判断，只要大于0就算描边区域（记得用step不要用if）五、总结目前没有找到完美的方案，要结合实际使用情况选择一种相对来说效果好一些的方案。","categories":[],"tags":[{"name":"Shader","slug":"Shader","permalink":"http://Jinnm.github.io/tags/Shader/"}]},{"title":"描边Shader","slug":"shader1","date":"2018-12-14T03:08:49.000Z","updated":"2019-03-24T05:33:37.241Z","comments":true,"path":"2018/12/14/shader1/","link":"","permalink":"http://Jinnm.github.io/2018/12/14/shader1/","excerpt":"","text":"写一个使3D物体带描边的shader是基于GPU的渲染的一项作业，关于这个作业有一些思考。描边shader有很多种写法，最常见最通用的是法线外拓的方法，就是用两个pass，第一个pass渲染红色的放大版模型（之后用A pass表示），第二个pass渲染正常的物体（之后用B pass表示），这样正常物体渲染结果会盖住A pass的结果，但由于A pass把模型放大了，所以会露出旁边的一圈“描边”。而如何放大模型？就是把模型顶点沿法线向外移动（移动距离用offset表示）。为了方便看到A pass的情况，互换了两个pass的位置，用立方体做模型，得到如下情况。发现A pass的前面在最顶层，接下来是B pass，最后是A pass的背面。因为默认开了Zwrite和Ztest，所以会根据顶点坐标的前后渲染。那么给A pass设置剔除正面只渲染背面（Cull Front）：会发现因为顶点沿法线向外移动导致面片分开，使得描边不连续。(这个问题可以通过在模型导入面板中把法线设置为calculate解决)换个复杂的模型：由于模型复杂，有些面片虽然是背面的，但还是会穿透B pass的面片。试想如果B pass能把A pass完全盖住就解决这个问题了。于是把A pass移到B pass之前，同时设置Zwrite off，也就是说不管A pass的顶点在哪里，都会被B pass的渲染结果盖住，这样就解决了这个问题。","categories":[],"tags":[{"name":"Shader","slug":"Shader","permalink":"http://Jinnm.github.io/tags/Shader/"}]},{"title":"Code, design, movie and photography","slug":"title","date":"2018-11-06T02:03:16.000Z","updated":"2018-11-06T02:59:31.373Z","comments":true,"path":"2018/11/06/title/","link":"","permalink":"http://Jinnm.github.io/2018/11/06/title/","excerpt":"","text":"Codemoph = Code, Design, Movie, Photography.","categories":[],"tags":[]},{"title":"游戏运营讲座","slug":"youce2","date":"2018-11-04T13:25:29.000Z","updated":"2018-11-04T14:38:28.607Z","comments":true,"path":"2018/11/04/youce2/","link":"","permalink":"http://Jinnm.github.io/2018/11/04/youce2/","excerpt":"","text":"虽然以后肯定做技术，不过今天去听了腾讯某游戏运营负责人的讲座，感觉收获颇多。（我好像是觉得什么都很有趣的体质？）由于今天讲的内容感觉太太太难接触到了，所以一定要把它记下来，可惜当时讲座要求手机关机而且没带电脑，我现在只能凭借记忆补全内容，有些做法以及原因想不太起来了QAQ。比如这位老师介绍说一个月中，大概第二周会集中拉高收入，第四周会拉高用户。原因是，月初大家比较有钱，而月末关系到下个月的新版本发布，版本发布时活跃用户数多才有意义。其中举了两个游戏的游戏的例子。（我最喜欢这种分析实例的讲座了！！！）刺激战场兑换小白裙这个活动取得了空前的效果，具体忘记达到了怎样的程度了……反正每到中午，大家都疯狂在群里问你有没有平底锅，我给你一个三倍镜之类。关于这个活动的重点：小白裙在端游是极其珍贵的物品。当时刺激战场玩家中端游玩家达到40%。好友间的分享只有一次。意犹未尽的感觉。集结好友 瓜分红包模仿拼多多的模式，大概就是在游戏中完成某个任务，比如击杀了两个人，就可以获得一个红包，红包里有很多礼品，只有你成功邀请几个好友“拼团”之后，才能瓜分红包拿到里面的东西。这个活动当时打破了微信固化了很久的红包模式，至今仍是最热的红包活动。这个活动的重点：学习了拼多多“有毒”的模式。小插曲：这位老师当时接触拼多多后觉得这个模式有毒，于是给团队布置任务：下次例会每个人带一件从拼多多免费获得的东西。之后团队就做了这个活动。全民飞机大战前期的情况想要在年后做一个活动，因为年后是游戏行业很恐怖的时间点，一般都是断崖式下跌。即将迎来第一次版本更新，而之前的游戏研发只用了两个月，是赶出来的。游戏玩法单调，靠着这种方式挽尊：出一个需要巨额金币的新品迫使用户打游戏攒金币。调研用户后发现两大需求：机甲和社交。活动内容于是在年后，第一次版本更新的一周后推出黄金斗士这架战机，这个活动几个关键点：时间：年后黄金斗士198元黄金斗士是很强的战机首充6元送168钻石（价值16元）DAU：打满6局奖励……PCU：限时金币翻倍黄金斗士大概长这样emmmm这个活动1.5周后推出了价格便宜的变形金刚。活动由来那么做这些活动的原因是什么呢？首先针对用户需求中的社交，推出合体的玩法，两架飞机可以合体来获取对方飞机的一部分属性，比如合体黄金斗士可以在死后再滑行8秒（在游戏中非常关键！）。而机甲方面则定下了两款：圣斗士星矢和变形金刚。并做了这样的考虑：圣斗士星矢——归为土豪款，金黄色，中国玩家的最爱。虽然美术组的审美很好，但最后还是屈服于玩家的口味。变形金刚——归为平民款，价格便宜。土豪款是为了造成贫富差距的感觉，有了优越感才有人愿意买呀。而平民款则满足了普通玩家对于机甲的需求。为什么定价198元呢？这里需要知道更多的信息，在此之前还有两个重要的战机。凤凰：48w金币购买，48w金币升级。48w金币大概需要玩45天，就是前面说的迫使用户打游戏攒金币的新品。丘比特：168元购买，800元升级。丘比特性能比较弱，最后效果奇差。黄金斗士：198元购买，48w金币升级。后面的48w金币很好理解，比起丘比特的天价升级费用，这个升级条件会刺激玩家购买黄金斗士，而且黄金斗士又比丘比特强很多（这个故事告诉我们，之前做的太差也是有好处的），最重要的是，一部分玩家之前为了升级凤凰已经攒的差不多了！手持可用于升级的金币，不到两百获得最最最高配战机，的确很有诱惑力。而198元则是数据分析的结果，大部分玩家消费都在200元以下，超过两百元就会犹豫。最后，为什么要等到新版本发布后的一周才做活动？因为游戏开发只用了两个月，这又是第一次版本更新，很有可能会有大bug，这样的话，没有人还愿意付费。还有几个小地方，比如首充奖励，这个只是借着大活动顺便增加付费用户。（此处我个人想法：还可以为之后的变形金刚铺垫）活动效果具体数据忘记了，反正也是很厉害。满贴吧都是“求合体黄豆（黄金斗士简称），加微信”。以上两个分析案例只是本次讲座冰山一角，印象比较深。整个讲座体现的运营核心不是收入而是用户：如果你没有用户，何谈收入，如果你有用户，又何必担心收入。","categories":[],"tags":[{"name":"other","slug":"other","permalink":"http://Jinnm.github.io/tags/other/"}]},{"title":"游戏策划基础","slug":"youce","date":"2018-11-03T09:45:32.000Z","updated":"2018-11-04T14:40:34.584Z","comments":true,"path":"2018/11/03/youce/","link":"","permalink":"http://Jinnm.github.io/2018/11/03/youce/","excerpt":"","text":"作业题目《谁更无聊》：你跟对手一起进入一个游戏，屏幕上除了关闭按钮什么都没有。只要对手比你先按下关闭按钮，那么你就赢了。在不改变核心玩法的前提下，添加哪些设计可以让这一款游戏变得不那么无聊。请从策划的不同分工角度，分类进行设计添加。作业提交内容核心玩法策划游戏开始前，显示对手的所获金币数和所玩局数。游戏开始后，整个界面只有中心的大关闭按钮，谁先按到这个按钮谁就输了，游戏也同时结束。而在游戏结束前，玩家可以在屏幕上用手指滑动（当然不能碰到关闭按钮）。游戏结束后，会计算两位玩家滑动距离的差值，胜者可以获得与差值对应的金币，而败者会被扣除与差值对应的金币。特殊情况，如果直到“极限时间”也依然没有人按到按钮的话，滑动距离多的一方获得与差值对应的金币，少的一方扣除与差值对应的金币。系统策划按钮模式系统、滑动距离计算系统、金币系统、计时系统、玩家匹配系统。关卡策划玩家可以选择不同的按钮模式进行游戏（按钮的形状、布局会有区别）。数值策划对于胜者败者，滑动距离差值对应金币数的规则。极限时间的设置。如果到了极限时间，最后的金币计算会变成普通情况的两倍。根据玩家的游戏情况判断玩家的情况，匹配合适的玩家。文学策划在游戏开始前，快速使玩家明白规则。在游戏结束后用合适的语言告知玩家结果。玩法分析首先，滑动距离越长，按到按钮的风险越大。因为如果想获得比较长的滑动距离，最好的方式是【高频率】【尽量长的直线来回滑动距离】，按钮的存在限制了直线来回滑动距离，而且越想增大距离风险越大。同样越增加频率，碰到按钮的风险也越大。所以想要在短时间获得高滑动距离又不碰到按钮是比较困难的。但是，滑动距离并不是越长越好，也有可能是越短越好，比如一个高滑动距离玩家不小心按到按钮，你的滑动距离是0的话获利最大。具体如何选择要看玩家的策略（线索来自对手的所获金币数和所玩局数）。所以玩家在这个游戏中需要在不按到按钮的情况下，赌自己划多长的距离合适。激进的话很容易按到按钮而被扣金币，保守的话如果对手也一直没按到按钮，很可能会被扣高额金币。","categories":[],"tags":[{"name":"other","slug":"other","permalink":"http://Jinnm.github.io/tags/other/"}]},{"title":"摄影 || 第二卷","slug":"photo2","date":"2018-10-28T13:29:40.000Z","updated":"2019-03-30T12:30:28.960Z","comments":true,"path":"2018/10/28/photo2/","link":"","permalink":"http://Jinnm.github.io/2018/10/28/photo2/","excerpt":"","text":"Olympus om-1Konica kmini","categories":[],"tags":[{"name":"Photography","slug":"Photography","permalink":"http://Jinnm.github.io/tags/Photography/"}]},{"title":"剧本策划","slug":"junben","date":"2018-10-26T12:12:27.000Z","updated":"2018-11-06T02:08:26.930Z","comments":true,"path":"2018/10/26/junben/","link":"","permalink":"http://Jinnm.github.io/2018/10/26/junben/","excerpt":"","text":"由于我们专业有些人以后会去当游戏策划或者做动画，所以专业选修里设置了剧本策划这个课程，外聘了浙江传媒学院老师。原本就很喜欢电影，于是就选了这门课。第一阶段前几节课的作业是找2-3个人物，想想他们可能发生的故事，分析创作的可能性于是大概想了这样一个故事主要人物陈医生：全市最好的牙科医生，有个即将高考的儿子，沉迷游戏，高考堪忧。王铭：陈医生的实习医生。王锵：王铭的弟弟，同样即将高考，成绩非常好，正常发挥可以考入北大。人物小传【陈医生】自小就非常优秀，成长经历也非常顺利，考上非常好的医学院，毕业后通过自己的努力成为全市最好的牙科医生，人生最大的挫折是他的儿子——陈震。陈医生时不时怀疑陈震是不是他的亲儿子，陈震小的时候就不聪明，成绩也差，网络游戏兴起后就沉迷游戏，更加一发不可收拾。陈医生每每想到这个儿子就觉得丢脸。他的同事们虽然自知医术不如陈医生，但是想到自己的孩子比陈医生的优秀，心里也便平衡一些，甚至有点同情陈医生有这样一个不争气的儿子。同事们这样看待他，陈医生心中自然也是有数的。【王铭】自小就非常优秀，成长经历也非常顺利，如今即将从浙大医学院毕业，在省口腔医院实习，实习导师是全市最好的牙科医生。高中的很多同学本科毕业就工作了，王铭也听闻一些同学的经历：有的同学凭借家里的关系有了不错的职位，薪水高而且工作轻松。有的同学虽然本科的大学很差，但学的计算机，本科毕业也顺利找到了薪水非常高的工作。王铭想到自己辛辛苦苦读了七年医科，最后却都不如这些成绩比他差得多的同学，感到失落和懊恼。他曾经为了能够取得好成绩所牺牲的那些，现在看来非常幼稚可笑。突然感觉自己的人生虽然顺利但也平淡，似乎预见到了自己庸庸碌碌的一生，便更加失落。【王锵】自小就非常优秀，成长经历也非常顺利，高中成绩经常处在全校第一，并通过化学竞赛拿到了北大一本线录取的优惠名额。于他来说，北大已是囊中之物，他是老师的骄傲，同学们的羡慕对象，他突然觉得从小备受亲戚称赞的哥哥王铭不过如此。高考前夕突然发现自己失去了高中的所有知识，一瞬间，仿佛从高空跌入谷底。故事主线【起】一天，王锵单独跟陈医生见面，恳求陈医生把他四天前拔掉的智齿移植回去，理由是，他拔掉这颗智齿后，智力倒退回了三年前，停留在初中刚毕业的时候。【承】陈医生觉得荒谬，但由于王锵执意坚持，而且似乎他也只是想试试，便觉得帮他装上去看看也无妨。碰巧陈医生的儿子最近也要拔智齿……王铭则安慰弟弟不必如此在意高考，表示自己即便考上名校，到如今也不如很多以前成绩差的同学。【转】在约定的那天，陈医生掉包了王锵的智齿，给他装上了刚从上一个患者口中拔下来的智齿。不料，王铭再次将真智齿掉包，意图出售给他人，于是陈医生给自己儿子装上了被王铭掉包了的智齿。【合】从医院出来后，王锵和陈医生的儿子焦急地等待着恢复……故事灵感灵感主要来自于彭浩翔的一个小短篇《指甲刀人魔》，有改变成电影，可惜电影并不好看，但是这个故事我莫名很喜欢。开篇就是男主的女朋友有一天突然跟他说：“我是指甲刀人魔。”所谓指甲刀人魔，就是以吃指甲刀为生的人。非常莫名其妙吧？男主想让女朋友吃指甲刀证明给自己看，女朋友却很生气：吃指甲刀是我们的生活方式，不是为了给你们表演来满足你们的猎奇心理的。男主试图通过其他小细节观察，但最后发现，他既无法证明这件事是真的，也没有办法证明它是假的。男主最后选择了无条件相信，卖掉了自己的车帮助女友实现愿望——开一家指甲刀餐厅，但是这个过程中却无时无刻不受“你的女友是个骗子”这种想法的影响。有一部电影有类似的情节，《那个男人来自地球》中，一所大学各个专业的教授聚集在一个即将离开的同事的小屋中聚会，那个同事突然说：“其实我已经活了几千年了。”大家都觉得荒唐。一屋子的教授所懂得知识的深度和广度都让人敬佩，但即便如此也却没有办法证伪。相比《指甲刀人魔》，这部电影所涉及的东西更加宏大，编剧显然博古通今（与故事发生的地点局限在一间小屋子里形成鲜明对比，堪称最省钱科幻片）。但依然是《指甲刀人魔》更加生活化的情节更打动我，同时它突出了这样一个结果：一件荒谬的，可以当做玩笑忽略的事，最终却切切实实地影响到了人的生活，甚至最终改变了人。于是就写了智齿这个故事，结构其实是一样的。开篇也是一个很荒谬的设定：王锵说拔掉了智齿，就拔掉了他高中三年的学习成果。这个设定同样不能证明真实性。而陈医生，王铭甚至王锵，实际上刚开始都是不相信的，但都因为各自的原因选择了相信。王锵高考在即，突然失去了高中时期的知识，如果不相信智齿，那么他就没有任何措施可以解决这个问题，智齿是他最后的希望。陈医生如果相信智齿，他就有机会让自己的儿子考上最好的大学。王铭如果相信智齿，他就可以借此得到一大笔钱，发泄自己不得志的痛苦。于是这三个人都因为开篇关于智齿的“猜想”，搅入了这个漩涡。至于这个猜想是不是真的实际上已不重要。第二阶段《智齿》剧本1，省口腔医院 日 内【王铭在桌边写着上一个病人的记录，陈医生坐在牙科椅边整理工具】陈医生：今天看的还蛮快的，只剩最后一个了，看来可以提前下班了。王铭：哈哈是啊，幸亏老师限号。（王锵推门而入）王铭（抬头拿病历本，看到王锵的脸后非常惊讶）：你来看牙吗？王锵（一脸阴沉）：嗯陈医生（看到病历本上的名字）：噢你就是王铭的弟弟啊，坐下说吧，牙什么问题啊？王锵（做到牙科椅上，一脸严肃）：陈医生您好，我大概四天前拔了一颗智齿，智齿当时用液氮速冻了的，现在想把它移植回去，您看可行吗？（陈医生和王铭面面相觑）王铭：啊？装回去？你在想些什么？陈医生（示意王铭先不要说话，一脸疑惑）：为什么要装回去呢？还有怎么会想到用液氮冻……王锵：液氮保存当时纯粹是为了好玩，我之前搞化学竞赛，可以用实验室的器材做这个。不过也是运气好，不然就没机会移植回去了。原因的话您不用管了，只要装回去就行了。王铭（一脸着急）：怎么不用管？移植牙齿又贵又难，而且你拔掉智齿不就是因为空间不足太疼了吗，我真的想不出有任何理由要装回去。陈医生：你还是说一下原因吧，这个手术不是小事。王锵（犹豫了一会儿）：说出来可能令人难以置信，但却是事实。（停顿了一下，凝视着陈医生的眼睛）我拔掉这颗智齿之后，智力退回到三年前的水平，其他东西都记得，就是高中三年好像什么都没学一样。我确定是智齿造成的，马上就要高考了，要是不赶紧装回去，我就完了。（王铭和陈医生再次面面相觑）王铭：会不会是压力太大了啊……要不请假在家里休息几天再看看吧。王锵（很不耐烦）：你以为我没考虑过这个吗，原本想着睡一觉就好了吧，但是现在都四天了！四天了！完全没有好转，我这几天就像高中新生一样从头开始学，高考只剩十天了！完全来不及！我没有乱猜，我拔智齿前还在想等会用液氮时具体要怎么操作，拔完之后就完全不知道了，只能找同学帮忙。一拔完就发现所有高中学的东西全忘了，哪有这么巧的？王铭：你先别急，高考真的没这么重要，浙大很不错了吧，我现在不也还是个普普通通的医生。我高考考差的同学有些考上了公务员，有些去了互联网公司，待遇都比我好多了。王锵（冷静下来）：之后的事之后再说，而且现在也没有其他办法了，不管怎样我都想试一试，如果还是不行，我就复读吧。陈医生：那颗智齿你带来了吗？王锵：还没，放在学校实验室，我想着先让你答应下来，然后我们约个时间。陈医生：你让我看看你原来长智齿的地方。（王锵张嘴，陈医生仔细检查）陈医生：我以前只做过拔下来半小时之内的，你的智齿理论上应该也能移植，但是冷冻保存了四天，以及你的牙窝已经有点愈合了，成功率可能不是特别高，我可以帮你试试，但我建议你还是安心准备高考或者准备复读，不要对此报太大的希望。你看下周一这个时间有空吗？王锵（欣喜）：可以的！陈医生愿意帮忙真是太好了。（严肃）不过，这件事情希望陈医生能够保密。陈医生：嗯嗯，这我知道的，毕竟不是普通的事。【王铭看着陈医生和弟弟，呆坐在桌边】2，陈医生家 晚 内【陈医生和妻子正在吃饭，突然陈医生的儿子陈震开门进来】（陈医生和妻子低头继续吃饭，陈震自己盛饭坐定）陈医生：怎么回来了，没钱啦？陈震（沉默了一会儿）：我突然感觉很没意思。陈医生：那你要怎样才有意思。陈震：我是真的感觉花这么长时间打游戏很不值。我今天终于打到了最高段位，突然感觉很饿，网吧小哥又不在，只好自己出门吃汉堡王。吃汉堡的时候我也不知道怎么回事，突然回过神来，最高段位又如何，不过是一串虚拟的数字啊。（陈医生和妻子像看外星人一样看着陈震，依旧难以置信）妻子（试探）：那你接下来打算怎么办？陈震：准备复读吧，我已经把我的游戏账号卖掉了。妻子（惊喜）：你可记住你刚刚说的话啊，不要明天又照常了。陈震：放心吧妈，我真的想通了【陈医生依旧自顾自的吃饭】3，陈医生家 晚 内【陈医生和妻子躺在床上仰面聊天】妻子：真想不到儿子居然有一天能想通，我还以为他没救了。陈医生：别高兴的太早，多看几天吧。妻子：也是，我也不太相信他就这么轻易的突然想通了。陈医生：不过陈震就算不打游戏，也不是读书的料子，搞不好他复读到一半失去信心，又回去打游戏寻求安慰。妻子：你要求怎么这么多，能不打游戏我已经谢天谢地了。陈医生：唉，你是不知道我同事都怎么看我的。妻子：怎么了？陈医生：他们医术上比不过我，（苦笑）我这个儿子对他们来说是最大的安慰吧。（妻子无言）陈医生：要是他真想通了也是挺神奇的，我们这么多年，什么方法都试过了，竟然都敌不过一顿汉堡王。妻子（笑）：他大概是突然感受到现实世界实实在在的小乐趣了。陈医生：今天发生的怪事可真多。妻子：嗯？还发生了什么？陈医生（突然侧过身面对妻子）：我的实习生王铭有个几乎保送北大的弟弟你听说过吧，就是考上一本线就能上北大了。妻子：知道啊，挺有名的，叫王锵吧。陈医生：对，就是他。他今天来找我看牙，让我把他四天前拔的智齿安回去。他说拔了这颗智齿后，高中学的所有东西都不记得，就好像全都凝结在智齿上一样，你说奇不奇怪。妻子（惊讶）：什么？这你也信？怎么可能啊，这孩子压力太大了吧。陈医生：或许吧。妻子：不过说到智齿，儿子刚刚跟我说他智齿大概也需要拔拔掉，疼了几天了，有空会直接去你单位找你的。陈医生（若有所思）：这么巧啊……妻子：有什么巧的，都是同龄人啊。陈医生（回过神）：哦哦是啊。妻子：那你跟王锵怎么说的，这孩子真奇怪。陈医生：我刚开始也不信，但是我想，帮他装回去试试也行。妻子（笑）：随便你吧。不过我觉得装回去不会有区别的，要是没用可不要怪罪给你。陈医生（笑）：那不会的，这个孩子还蛮理智的（仿佛回忆着什么）他自己也只是想试试吧。妻子（笑）：好了，睡觉吧。【妻子睡觉，陈医生睁着眼睛若有所思】4，教室门口 白 外【老师拿着批到一半的作业本把王锵从教室叫出来，王锵紧张的出了门，同学们好奇的看着王锵和老师】老师：王锵啊，北大给你一本线的优惠后，你的确睁半只眼就能上北大了，但是还是要注意一下学习态度。王锵（低头）：嗯嗯。老师：你最近的作业低级错误很多，而且还有很多空着不做，希望你最近注意一下。王锵：嗯我以后会注意的。老师（叹气）：即便这么大的优惠也是有风险的，我建议你还是当做没有这个优惠照常学习。王锵（似乎有难言之隐）：……嗯好的。老师（犹豫了一下）：以及我这样说可能会给你点压力，这个优惠的名额你也知道，是每个高中分配的，你的高考成绩会影响到明年的名额分配，从为学弟学妹着想的角度，还是希望你裸分也考到录取线。王锵（神色凝重）：……嗯好，我会加油的。老师（笑，拍拍王锵）：你向来最让老师放心，好了，回去上课吧。【王锵神色凝重的回到教室，同学们窃窃私语】5，省口腔医院 白 内【陈医生正在给一位患者看牙，连续几个患者张嘴后陈医生都露出了失望的表情，直到一个患者张嘴，陈医生舒了一口气】陈医生（敲敲患者的一颗牙齿）：你这颗智齿有什么难受的吗？患者：没有啊。陈医生：以后会越来越难受的，已经磨损到口腔黏膜了。患者：啊？我同学倒是蛮多需要拔的。但是听说不难受就不用拔。陈医生：现在不难受而已，以后会疼的厉害，建议尽早拔掉。患者：哦哦这样，（犹豫了一会儿）我也不赶时间，那就今天拔掉吧。陈医生果然名不虚传，其他医生应该都看不出来需要拔吧。（陈医生讪讪地笑了一下，然后熟练的操作帮患者打麻药，拔下智齿）陈医生：你先这样躺着止会血再走，这样比较好。（患者感激地点头，陈医生随即用镊子夹起智齿离开，过了一段时间回来，口袋里鼓鼓的，像是放了一个小瓶子）陈医生：差不多了，回去再止一会儿，这几天注意饮食和伤口的清洁。【患者起身捂着嘴点头离开】6，省口腔医院 白 内【陈医生掏出手机打电话】陈医生：喂？小震啊，你下午六点过来拔智齿可以吗？……陈医生：当然是越早拔越好啦。……陈医生：这个没事的，我会帮你跟老师请假的。……陈医生：好的，那你尽量准时到，早了也是要等上一个病人的。……陈医生：那就这样，别忘了啊。【陈医生走回诊室，若有所思】7，省口腔医院 白 内【王锵和王铭一起走进来，陈医生抬头看到他们有点惊讶】陈医生：王铭你今天不是休息吗？王铭：我陪我弟弟呀。陈医生（紧张，下意识的遮挡口袋凸起的地方）：哦哦对呀，我给忘了。（王锵拿出一个小瓶子递给陈医生）王锵（紧张）：您看还有希望移植回去吗，应该没问题吧？陈医生（拿着瓶子观察）：这样看看不大出来，这是刚刚从-80度环境里拿出来的吗。王锵：是的，一拿出来就马上过来了，才隔了十分钟吧。陈医生：那要尽快，我先去做一下恢复处理吧。王锵：好。【陈医生拿着王锵的智齿离开，王铭跟了上去】8，省口腔医院实验室 白 内【陈医生进实验室把装着王锵智齿的瓶子放到桌上，正要把口袋里的瓶子拿出来，王铭就跟了进来，陈医生赶紧塞了回去，但还露出一小截，只能用手臂遮掩】陈医生（强作镇定）：怎么了吗？王铭：我看看有没有需要帮老师的。陈医生（干笑，转身面对架子背对王铭，左手假装找试剂，右手趁机调整口袋中瓶子的位置）：这个操作不复杂啊，你去陪你弟弟吧，我看他挺紧张的。王铭（走上前，用身体挡住桌上装着王锵智齿的瓶子）：其实我也挺紧张的，您看装上的成功率有多大（从口袋里拿出一个一模一样的装了一颗智齿的瓶子放到身后的桌上，并把装着王锵智齿的瓶子放入口袋）陈医生（紧张）：这个很难说……实验室里有些东西比较重要，你还是先出去吧。王铭：哦哦不好意思，那我出去了。陈医生（表情有些舒缓）：嗯嗯。【王铭推门出去，陈医生如释重负】9，省口腔医院 白 内【王锵和王铭两个人看起来都非常焦虑，陈医生将处理好的智齿放在一个容器中拿了过来】陈医生：还是有活性的，成功率应该挺高的。（王锵露出了欣喜的神情，王铭也露出了欣喜的表情）王锵（舒了一口气）：那开始吧。（王铭突然拿出手机，手机上显示收到一条信息：搞定了吗。王铭回复：搞定了，钱准备好了吗。消息回复：ok的。）王铭：突然有个急事，好像不能陪王锵了。王锵：没事，你忙你的。王铭：那我先走了，祝成功哈~王锵（躺上牙医椅）：嗯嗯。【王铭急匆匆离开了就诊室，陈医生开始给王锵做移植】10，省口腔医院 白 内【移植术结束后】陈医生：好了，还是蛮成功的，不过还是要过几天再观察是不是真的成功了。你现在感觉有什么变化吗？王锵（仔细思索了一下）：好像没有。陈医生：别急，可能只是现在没长好，再等几天吧，再不行你就安心学习吧，不要再想智齿了。王锵（失落）：嗯。【王锵离开后，陈震走进了诊室，陈医生熟练的操作，拔掉了陈震的智齿】陈医生：躺着止血吧，后面也没其他病人了。（陈震点头，一刻钟后，陈医生将药棉拿掉看了看，随后再次拿起工具）陈医生：这个地方最好还是要填充一些东西的，我帮你弄弄好。（陈震露出了疑惑的神情，但还是让父亲操作）11，王锵家 晚 内【夜里十一点，王锵坐在家中看书，神情看上去烦躁不安，额头渗出了汗珠】12，陈医生家 晚 内【陈医生躺在床上辗转难眠】","categories":[],"tags":[{"name":"Movie","slug":"Movie","permalink":"http://Jinnm.github.io/tags/Movie/"}]},{"title":"App的icon颜色跟App类别的关系","slug":"AppIcon","date":"2018-10-23T13:01:46.000Z","updated":"2018-11-04T14:20:28.278Z","comments":true,"path":"2018/10/23/AppIcon/","link":"","permalink":"http://Jinnm.github.io/2018/10/23/AppIcon/","excerpt":"","text":"手机里的app有一百多个吧，不太喜欢用ios的app文件夹，觉得有点难看，所以一般用页来分类，每个类别一页或者几个类别一起拼成一页。于是就很容易发现购物那一页全线飘红（无视下面的视频类）。很容易想到这不是偶然，大家都心知肚明暖色可以激发人买买买的欲望。那么其他app呢？微信是绿色的，支付宝是蓝色的，网易云音乐是红色的，这些颜色是如何选择的？这几个app的颜色选择可能有一定的偶然性，但是一个类别比如购物类有明显暖色倾向的话，颜色的选择就不是偶然了，那么除了购物类之外其他类别有没有颜色倾向呢？碰巧会爬虫也会opencv，刚好也知道描述视觉感觉的话可以用Lab空间计算距离……既然已经想到这一步了就来做一下吧！大致思路就是把App Store上的app图标按类别爬下来选择常见的几种颜色比如红、绿、蓝、黄、品红、青作为标准色用OpenCV分析一下图片的颜色，转换到Lab空间，计算出到哪个标准色距离最短把结果可视化方便得出结论爬取图片以下是代码，加了非常详细的注释，App Store的网站非常友好哈哈哈123456789101112131415161718192021222324252627282930313233343536373839# coding:utf8import requestsfrom bs4 import BeautifulSoup# 浏览器请求头（大部分网站没有这个请求头会报错）headers = &#123;&apos;User-Agent&apos;: &quot;Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.1 (KHTML, like Gecko) Chrome/22.0.1207.1 Safari/537.1&quot;&#125;all_url = &apos;https://itunes.apple.com/cn/genre/ios-%E5%9B%BE%E4%B9%A6/id6018?mt=8&apos; # 开始的URL地址start_html = requests.get(all_url, headers=headers) # 加了头的地址Soup = BeautifulSoup(start_html.text, &apos;lxml&apos;) # 解析HTML# 找到类别列表 &lt;div id=&quot;genre-nav&quot; class=&quot;nav&quot;&gt;all_lei = Soup.find(&apos;div&apos;, class_=&apos;nav&apos;).find_all(&apos;a&apos;)for lei in all_lei: # 取一个类别 lei_url = lei[&apos;href&apos;] # 取该类别的链接 lei_html = requests.get(lei_url, headers=headers) # 加了头的地址 lei_soup = BeautifulSoup(lei_html.text, &apos;lxml&apos;) # 解析HTML # 找到类别网址里的app排行榜 &lt;div id=&quot;selectedcontent&quot; class=&quot;grid3-column&quot;&gt; all_app = lei_soup.find(&apos;div&apos;, class_=&apos;grid3-column&apos;).find_all(&apos;a&apos;) f = open(&apos;图书&apos;+&apos;.txt&apos;, &apos;w&apos;) # 以类别名称命名txt for a in all_app: # 取出app排行榜中的一个app title = a.get_text() # 取类别名称 print(title) app_url = a[&apos;href&apos;] # 取出该app的链接 app_html = requests.get(app_url, headers=headers) # 加了头的地址 app_soup = BeautifulSoup(app_html.text, &apos;lxml&apos;) # 解析HTML # 找到app页面中的icon &lt;div class=&quot;product-hero__media l-column small-5 medium-4 large-3 small-valign-top&quot;&gt; icon = app_soup.find(&apos;div&apos;,class_=&apos;product-hero__media l-column small-5 medium-4 large-3 small-valign-top&apos;).find_all(&apos;img&apos;) for img in icon: src = img[&apos;src&apos;] print(src) f.write(src + &apos;\\n&apos;) # 将icon地址写到以类别命名的txt文件中 f.close() # 得到一个以某个类别命名的txt文件 里面有该类别240个app的icon的地址# 得到所有类别的txt爬完之后就得到了每个类别前240个icon图片的链接，用下载器下载下来就搞定了分析颜色批量读取图片12345width = 246height = 246size = height * width # icon尺寸path = &apos;/Users/Jinnm/Desktop/pic/&apos;dirs = os.listdir(path) # 导入该路径中的所有文件名颜色空间转换图片里每个像素转换1234567for i in dirs: img = cv2.imread(path + i, cv2.IMREAD_COLOR) # 导入文件 img2 = [] for j in range(0, width): for k in range(0, height): # 存储每个像素点的lab值, trans为转换函数 img2.append(trans(img[i][j][2], img[i][j][1], img[i][j][0]))标准颜色的转换123456# 设定标准的13种颜色的rgb值rule = [[255, 0, 0], [255, 147, 0], [255, 255, 0], [0, 255, 0], [0, 255, 255], [0, 0, 255], [148, 32, 146], [255, 64, 255], [171, 69, 0], [171, 121, 66], [165, 165, 165], [0, 0, 0], [255, 255, 255]];rule2 = [];# 储存13种颜色的lab值for i in range(0, 13): rule2.append(trans(rule[i][0], rule[i][1], rule[i][2]));转换函数（依照rgb转lab公式)123456789101112131415161718192021222324252627282930313233def trans(r,g,b): #根据公式把rgb数据转到lab def calV(V): if V &lt;= 0.04045: return V / 12.92 else: return ((V + 0.055) / 1.055) ** 2.4 def calXYZ(R, G, B): sR = calV(R / 255.0) sG = calV(G / 255.0) sB = calV(B / 255.0) x = 100 * (0.4124564 * sR + 0.3575761 * sG + 0.1804375 * sB) y = 100 * (0.2126729 * sR + 0.7151522 * sG + 0.0721750 * sB) z = 100 * (0.0193339 * sR + 0.1191920 * sG + 0.9503041 * sB) return [x, y, z] def f(t): if t &gt; ((6.0 / 29) ** 3): return t ** (1.0 / 3) else: return 1.0 / 3 * 29 * 29 / 6 / 6 * t + 16.0 / 116 def calLab(X, Y, Z): X_n = 94.813 Y_n = 100.000 Z_n = 107.262 L = 116 * f(Y / Y_n) - 16 a = 500 * (f(X / X_n) - f(Y / Y_n)) b = 200 * (f(Y / Y_n) - f(Z / Z_n)) return [L, a, b] R = int(r) G = int(g) B = int(b) [x, y, z] = calXYZ(R, G, B) [L, a, b] = calLab(x, y, z) return [L, a, b]量化图片颜色计算在lab颜色空间中与标准色的距离，将每个像素点量化到距离最小的标准色，并记录一张图片中各个标准色的像素数量12345678for i in range(0, width * height): dist = [] for j in range(0, 13): # 记录下像素点与13种颜色在lab颜色空间中的距离 dist.append( (img2[i][0] - rule2[j][0]) ** 2 + (img2[i][1] - rule2[j][1]) ** 2 + ( img2[i][2] - rule2[j][2]) ** 2) num = [0] * 13 pos = dist.index(min(dist)) # 读取距离最小的颜色序号作为该像素点的代表 num[pos] += 1 # 一张图中所有像素点的代表颜色的数量统计保存结果将结果保存到exel12345678import xlwtbook = xlwt.Workbook(encoding=&apos;utf-8&apos;);sheet =book.add_sheet(&apos;test&apos;); # 建立存储数据的excel表flag = 0;for j in range(0, 13): sheet.write(flag, j, label=num[j]); # 把统计数据写入excel表中 flag += 1;book.save(&apos;/Users/Jinnm/Desktop/result.xls&apos;); # 保存excel表结果大概是这个样子（13列是13种颜色）可视化结果刚好下个学期有可视化的课程，打算学习之后处理一下这个结果，目前先用最最普通的柱状图表示结果分析对结果的柱状图进行初步的分析。发现结果跟自己预想的不太一样哈哈，原本感觉购物暖色，社交冷色，结果社交类中暖色的比例也非常高。总体现象一：白色在所有大类中均占最高的比例猜测原因：大部分icon喜欢采用白底+logo的配置，由于logo在icon中占的像素数少，导致大量的icon被归类于白色主色调。至于为什么都喜欢采用白底，猜测是因为白色的icon背景带来更好的融合性和统一性，以ios系统为例，自带的系列图标很多都是这个形式，那么第三方也采用这个形式会使界面比较统一协调。白色可以为用户提供清新干净的视觉体验，去掉不必要的视觉干扰，从而更集中于logo。而五彩斑斓的杂色的图标往往容易让人有嘈杂的眩晕感。由于颜色带来的视觉效果是互相影响的，而白色一般不影响其他颜色观感，是一个非常好的“搭色”。现象二：暖色在统计数据中比重较高猜测原因：现在每个用户都有大量app排列在手机中，暖色相较于冷色往往更为显眼，用红色与黄色作为icon的主颜色会使该icon更为醒目，从而增加用户的点击使用率。现象三：配色选取大多数少于3种这一块目前通过这个柱状图是看不出来的，但是观察exel的表格可以发现，一个icon在很多颜色上的像素数都是0或是数值很小，数值明显特别大的颜色一般在三种以内。另一方面也说明了目前这种数据可视化的方式有很多不足。猜测原因：icon是一个很小的图标，简洁的图案和配色会比较适合这种小区域猜测，清晰而又令人印象深刻。而且再观察之后可以发现，多种颜色一般是相近的颜色。采取色相接近的配色方案主要是为了使得icon整体观感统一和谐。分类在红色白色总体占比大的情况下，单纯的看一个类别的柱状图，那每一个类别都是红色白色是主要颜色了……所以分类的分析采用横向对比的方法，观察相对其他类别而言，哪些颜色比较突出，哪些颜色显得特别少。这一方面的分析目前的柱状图也很不合适，而且每张图的纵坐标比例是不一样的，所以不能直接比较高度……种类：摄影现象：黑白两色的比例极高，彩色运用明显比较少，但在相对运用比较少的彩色中红色占比还是比较大的。猜测原因：多数的摄影app喜欢标榜个性，追求性冷淡的高端简洁风。除去这一些以外的摄影app往往是针对女性用户群的，故多用女性更偏好的红粉色调。种类：商务现象：绿、青、蓝、紫的比例较高猜测原因：这一类冷色调的颜色往往给用户以平和安稳的感觉，会让用户更倾向去信赖。而且这些冷色调是没有性别偏好的颜色，男女中都有大量的用户群偏好这种颜色，所以这是一个非常容易使用户产生好感的颜色。种类：社交现象：白色的比例较低猜测原因：大部分的社交软件更倾向于用彩底突出吸引力。而且相较于白底的平淡无奇，彩底更能使得这些社交软件显得活泼生动而愉悦，营造更为轻松的氛围。种类：购物现象：红色比例极高猜测原因：红色等暖色可以给用户一种视觉上的刺激感，在使icon更具冲击力的同时，也某种程度上促进了用户的购买欲，从而促进快速消费。这也是为什么大多数快餐店会选择这类冲击性大的暖色。总结结果还是和自己平时的感受有挺多不一样的，看来数据是王道哈哈哈。目前最大的不足就是数据可视化，不合适的可视化使得直观地看出规律变得非常困难。","categories":[],"tags":[{"name":"other","slug":"other","permalink":"http://Jinnm.github.io/tags/other/"}]},{"title":"设计 || 分答模式的设计与启发","slug":"design2","date":"2018-10-16T02:43:28.000Z","updated":"2019-03-30T13:00:22.241Z","comments":true,"path":"2018/10/16/design2/","link":"","permalink":"http://Jinnm.github.io/2018/10/16/design2/","excerpt":"","text":"分答的设计回答者：回答自己愿意回答的问题，获得 90% 问题酬劳以及所有偷听者每人 0.5 元偷听费；提问者：提出问题，付出问题酬金（如果回答者没回答则不收取费用），获得所有偷听者每人 0.5 元偷听费；偷听者：听自己感兴趣的内容，每次给出 1 元偷听费；分答平台：从提问者的酬金当中收取 10%。造成的结果回答者：使得自己所知道的信息成功变现提问者：得到了想要的答案，同时，如果提了一个答主愿意回答，又有很多人感兴趣的问题，有机会赚取比酬金更高的偷听费偷听者：用极低的成本得到了感兴趣的信息分答平台：赚取抽成好的平台规则就是使得大家都觉得自己赚了。分答初期非常火爆，是当时的现象级产品。但在分答的平台中，回答者是靠明星撑起来的（初期用王思聪等引流），而对明星来说，在分答的收益并不值得一提，明星对分答的新鲜感消退以及合约任务完成后，这个模式就失去了活力。但是明星在这里是一种特殊情况，在回答者这一环维持住时，分答的火爆表明了这个模式还是值得借鉴的。启发把用户分成两类，并使他们互相影响分答模式的关键在于把付费用户分成两类，一类是有兴趣但不愿投入太多的吃瓜群众（偷听者），一类是有资本也有野心的高付费者（提问者）。而且分别对这两类用户提供不同的模式甚至在他们之中建立连接。分成两类人群，一方面对于不同的人群使用不同的模式会更有针对性，另外一方面分成两类后，两类人的心理会互相影响。比如就是由于高付费者的存在，吃瓜群众才能感受到自己占了便宜。而吃瓜群众的存在也会让高付费者有一些心理不平衡，想要在付费后将利益最大化的欲望会更加强烈。可以试图模仿一下这个模式。比如一个王者荣耀皮肤，定略高一些的价格，300元一个，除了购买者外的其他玩家可以在开售半个月后以1元每小时的价格租用这个皮肤（租用数量可以做个限定），皮肤拥有者们有资格平分他们使用该皮肤游戏期间所获得的租金收入的80%，另外20%给游戏制作方。比如某天19：00到20：00，有10个购买者使用该皮肤游戏，限定租用额为使用玩家的100倍，租用额满的话就是1000个玩家选择租用，那么这一个小时内，每个租用者花费1元，每个购买者可以获得80元，平台获得200元。在这种情况下：购买者：相比普通玩家提前半个月体验+之后可以获得收入租用者：用低廉的价格体验了只想短期使用的皮肤平台：使得付费用户的比例提高，同时增加用户尤其是购买者的粘性。由于租用额的限定，会使得冷门游戏时间用户数增多。细调规则的具体数值可能会使总收入增加。规则比普通情况下稍微复杂一点点这样就产生一种好像能够运用智慧褥羊毛的错觉，会激发用户参与的兴趣，但是过于复杂就会适得其反，比如规则越来越复杂的双十一活动（虽然因此赶走了许多用户，但是按照复杂规则获得优惠的用户会非常非常珍惜这点优惠，一般会买足够多的东西来达到优惠条件……总的来说可能还是成功的）。例子可以参考上一条，用户一旦开始考虑是购买者合算还是租用者合算，就差不多是付费用户的一员了，无论他最终选择哪一个。","categories":[],"tags":[{"name":"Design","slug":"Design","permalink":"http://Jinnm.github.io/tags/Design/"}]},{"title":"摄影 || 胶片初体验","slug":"photo1","date":"2018-10-15T05:41:06.000Z","updated":"2018-11-03T10:15:41.404Z","comments":true,"path":"2018/10/15/photo1/","link":"","permalink":"http://Jinnm.github.io/2018/10/15/photo1/","excerpt":"","text":"之前用数码相机拍照时一个场景拍完总觉得不满意，接着会拍好几张（毕竟数码相机多拍几张不心疼），后期选时又选不出来（最后发现都差不多，人生一大错觉：第一张拍的不好只是失误，多拍几张会发现自己就是这个水平hhh）。再加上票圈一个胶片机玩家晒的照片颜色实在太太太好看了（虽然数码也能调但是越来越懒于后期了……），于是决定体验胶片机！目前用一个傻瓜机和奥林巴斯om1分别拍了两卷，原本是三卷，其中一卷没挂上，被告知空白卷……另外还碰到了很多很窒息的事，比如测光不准，很多照片欠曝等等，还有许多奇奇怪怪的车祸照片，能拯救的都尽量拯救了一下……几乎不需要后期的感觉很爽，当然比起数码相机会有很多遗憾，奇妙的感觉。下面就是照片啦~两卷混在一起了，除了过于车祸的全放上来了","categories":[],"tags":[{"name":"Photography","slug":"Photography","permalink":"http://Jinnm.github.io/tags/Photography/"}]},{"title":"影评 || 情书，关于死亡","slug":"movie1","date":"2018-10-05T14:42:34.000Z","updated":"2019-03-30T12:59:53.034Z","comments":true,"path":"2018/10/05/movie1/","link":"","permalink":"http://Jinnm.github.io/2018/10/05/movie1/","excerpt":"","text":"国庆回家路上无聊，想随便挑一部电影看，想到岩井俊二+陈可辛+周迅的新电影《你好，之华》快上映了，便打算再看一遍《情书》，反正它在我的记忆中也非常模糊了，只记得大致情节和开场中山美惠在雪地里经典的一抬头。（其实之前对于秋叶烧制玻璃时油腻的样子印象也蛮深刻的）《情书》的剧情大概是这样：日本神户某个飘雪的冬日，渡边博子在前未婚夫藤井树的三周年祭日上又一次悲痛到不能自已。正因为无法抑制住对已逝恋人的思念，渡边博子在其中学同学录里发现“藤井树” 在小樽市读书时的地址时，依循着寄发了一封本以为是发往天国的情书。不想不久渡边博子竟然收到署名为“藤井树”的回信，经过进一步了解，她知晓此藤井树是一个同她年纪相仿的女孩，且还是男友藤井树少年时代的同班同学。为了多了解一些昔日恋人在中学时代的情况，渡边博子开始与女性藤井树书信往来。而藤井树在不断的回忆中，渐渐发现少年时代与她同名同姓的那个藤井树曾对自己藏了一腔柔情……而当博子去拜访女性藤井树时，发现自己与她的样貌非常相似，不禁陷入更深的痛苦。男性藤井树的好友秋叶如今是博子的现男友，则因为博子的念念不忘感到懊恼。另外，电影中比起小说增加了这样的情节：女性藤井树一直处在感冒状态，而她的父亲就是伤寒去世的，电影结尾女性藤井树终于高烧病倒，命悬一线，而此时却偏偏碰到了暴雪，救护车难以赶到，这个状况和她父亲当年的情况如出一辙，但女主的爷爷和妈妈这次成功救回了亲人。第一次看这部电影大概是高一的时候，那个时候的我特别喜欢看口碑大片或是烧脑电影，口碑大片比如肖申克的救赎，阿甘正传，霸王别姬等等，基本高分电影和比较有名的九十年代以来的奥斯卡最佳影片都看过。烧脑电影比如诺兰的几部电影，昆汀的低俗小说等等，我惊叹于它们构思的精巧并沉迷其中……总之对于《情书》这种小清新的情情爱爱的电影是不屑的（不过现在已经能被各种类型的电影所打动了，除了恐怖片……）我会想到看这部电影的契机是某次很闲的夜自习，偶然在杂志上看到了小说《情书》的选段，选段的开始，博子已经明白了这个跟她通信的藤井树是跟她男友同名同姓的高中同学，于是希望藤井树给她讲一讲博子男友高中时期的故事。通过来回的书信，两个同名同姓少年的故事徐徐展开……整体的感觉就是很舒服，而且故事的设计也相当巧妙（这是当时比较戳我的原因，感觉它是非常特别的“言情小说”），由于我并没有从两个藤井树的故事中感觉到情愫，所以我看到结尾的时候还是蛮惊讶的，于是就更加打动我了（噗……）。当天晚上便找了情书的全文看，然而感到非常失望！！因为我发现我之前看的选段就是最精彩甚至可以说是唯一出彩的一部分。但是还是趁热打铁看了电影。第一次看完这部电影的想法是：博子好惨，男友去世了不说还发现男友跟自己在一起好像是因为她跟他的暗恋对象长得像；秋叶好惨，女友对前男友念念不忘，而且她前男友还是他好朋友，他无论怎么做都很尴尬；男性藤井树也好惨，默默喜欢藤井树这么久，之后还因为事故英年早逝……所以我当时对于这部电影的印象是：就是一部情爱电影啊，不过构思精巧了些。然而今年国庆再看时却发现，这是一部讲死亡的电影。书信的往来，藤井树与藤井树的感情，博子秋叶藤井三人的感情纠葛，似乎都只是“配角”。电影中有大量片段描述着主角们与“死亡”的纠葛，探讨着死亡对于留世之人的巨大影响。尤其是比起原著，电影增加了女性藤井树的家庭故事，进一步给死亡的主题增加可探讨的内容。博子对于藤井树的死亡。秋叶对于藤井树的死亡。藤井树对于藤井树的死亡。藤井树对于父亲的死亡。藤井树的妈妈和爷爷对于她父亲的死亡。藤井树的妈妈和爷爷对于濒临死亡藤井树。博子对于死去的藤井树，刚开始只是失去爱人的痛，后来和秋叶一起后，还多了一份愧疚，再后来知道女性藤井树之后，又多了一份埋怨和不甘。秋叶对于死去的藤井树，有失去挚友的痛，但也庆幸有机会和博子在一起了，但对于自己的庆幸又感到自责，同时因为博子对已经死去的藤井树依然念念不忘感到懊恼。女性藤井树得知藤井树因为事故去世时，已经渐渐回忆起他们高中时的故事，对于他的去世，不仅仅只是遗憾于一位高中同学的去世。藤井树父亲的死亡于她，是一个模糊的心结。父亲去世时她似乎还很小，懵懵懂懂的父亲就去世了，葬礼时也远没有妈妈和爷爷这么痛苦。藤井树当时去她家还书，问她为什么请假时，她轻松地回答是葬礼。但她多年后去医院仍然会回忆起那天夜里送父亲进医院的情景，这种伤痛是一种隐隐但却绵长的伤痛，仿佛是山谷中回响的叹息。而藤井树的妈妈和爷爷，经历了两次暴雪之夜亲人病危的情况。第一次碰到时，妈妈主张按医院说的，在家给病人做暂时性的处理，等待救护车的到来，而爷爷则执意背儿子去医院，最后虽然成功送到了医院，但是一个人失去了丈夫，一个人失去了独子。当第二次碰到时，妈妈更加坚定等救护车的到来，表示给病人保暖才是重要的，爷爷依旧执意要背去医院，确信这次他跑过去，可以花比救护车更短的时间，最后妈妈选择了爷爷的方式，虽然爷爷比不上十几年前的自己，但似乎是凭着对儿子的愧疚，拼力将藤井树送到了医院……最后一个人保住了自己的女儿，一个人保住了自己的孙女。这里还有一个小故事，之前妈妈不顾爷爷反对，打算卖掉三人相依为命的老房子搬到现代的公寓，并找了藤井树的姑父做中介，姑父听说藤井树父亲的去世死因是伤寒之后表示自己完全忘了，而且因为伤寒这个死因哈哈大笑……此处也是生之人对死之人的一处描写。而在那个藤井树病危的夜晚之后，妈妈突然表示听从爷爷的心愿，不搬家了。生者受死者的影响，但是生者最后释怀了，这才能使一部电影结局。从藤井树的父亲到藤井树，妈妈和爷爷一次输给了死神，一次赢了死神。从藤井树病危那一晚的情况来看，虽然在藤井树父亲死后，妈妈和爷爷都没有正面提起这件事，但是两人从来都没能释怀，都对那一晚他们是否做了正确的选择，是否是因为自己的选择害死了藤井树的父亲，而耿耿于怀了十几年。但第二次赢了死神之后，这种状况得到了很大的改善，妈妈和爷爷更加平和地看待藤井树父亲的死亡，也更加真诚地互相理解和体谅。这是一种对死亡的释怀。而另一种，是博子和秋叶的。藤井树去世之后的三年来都是他们生活中沉重的阴影，索性秋叶是个洒脱之人，他最后带博子去了藤井树出事的雪山，带着博子向那座雪山问候。“你好吗？”“我很好”“你好吗？”“我过的很好”。博子声嘶力竭的喊着，脸上挂着泪和笑意，秋叶在背后看着博子，感到宽慰。这一刻，他们挣脱了藤井树的死亡所带来的阴影。我还没有经历过任何死亡，但这部电影关于死亡的描述却给了我如此深刻的感受，我想这就是为什么有人说，“电影使人生延长了三倍”吧。","categories":[],"tags":[{"name":"Movie","slug":"Movie","permalink":"http://Jinnm.github.io/tags/Movie/"}]},{"title":"RealTimeRendering Ch.2","slug":"RealTimeRendering2","date":"2018-09-24T13:01:43.000Z","updated":"2018-10-20T11:50:23.112Z","comments":true,"path":"2018/09/24/RealTimeRendering2/","link":"","permalink":"http://Jinnm.github.io/2018/09/24/RealTimeRendering2/","excerpt":"","text":"ArchitectureThe speed of the pipelines is determined by the speed of the slowest stage called bottleneck. The fatest is called starved, because it needs to wait for other stages to be done.A coarse division of the real-time rendering pipeline into four main stages: application, geometry processing, rasterization, and pixel processing.Application StageRunning on CPUs.But some application work can be performed by the GPU, using a separate mode called a compute shader. This mode treats the GPU as a highly parallel general processor, ignoring its special functionality meant speciﬁcally for rendering graphics.Some of the tasks traditionally performed on the CPU include collision detection, global acceleration algorithms, animation, physics simulation, and many others, depending on the type of application.The application stage is also the place to take care of input from other sources, such as the keyboard, the mouse, or a head-mounted display.Acceleration algorithms, such as particular culling algorithms (Chapter 19), are also implemented here, along with whatever else the rest of the pipeline cannot handle.Output: Rendering Primitives, i.e., points, lines, and triangles, that might eventually end up on the screen.Geometry ProcessingRunning on GPUs.The geometry processing stage on the GPU is responsible for most of the per-triangle and per-vertex operations.This stage is further divided into the following functional stages: vertex shading, projection, optional vertex processing, clipping, and screen mappingVertex ShadingTwo main tasks:computing the position for a vertex, also called MVPevaluate whatever the programmer may like to have as vertex output data (such as a normal and texture coordinates)The operation of determining the eﬀect of a light on a material is known as shading. Shading may be performed on a model’s vertices or during per-pixel processing.A variety of material data can be stored at each vertex, such as the point’s location, a normal, a color.ProjectionProjection is expressed as a matrix.orthographic(parallel) projectionTransforming a rectangular box to a unit cube, and parallel lines remain parallel after the transform.perspective projectionPerspective Frustum(截头视椎体)Then follows Normalized Device Coordinates(NDC, 坐标归一化).Both orthographic and perspective transforms can be constructed with 4 × 4 matrices.They are called projections because after display, the z-coordinate is not stored in the image generated but is stored in a z-buﬀer. In this way, the models are projected from three to two dimensions.Optional Vertex ProcessingTheir use depends both on the capabilities of the hardware—not all GPUs have them—and the desires of the programmer.Tessellation(图元细分)The camera for the scene can be used to determine how many triangles are generated: many when the patch is close, few when it is far away.Geometry ShaderIt can be used for particle generation(粒子生成).Imagine simulating a ﬁreworks explosion. Each ﬁreball could be represented by a point, a single vertex. The geometry shader can take each point and turn it into a square (made of two triangles) that faces the viewer and covers several pixels, so providing a more convincing primitive for us to shade.Stream OutputIt can be used for particle simulations(粒子模拟).This stage lets us use the GPU as a geometry engine. Instead of sending our processed vertices down the rest of the pipeline to be rendered to the screen, at this point we can optionally output these to an array for further processing. These data can be used by the CPU, or the GPU itself, in a later pass.These three stages are performed in this order—tessellation, geometry shading, and stream output—and each is optional.ClippingOnly the primitives wholly or partially inside the view volume need to be passed on to subsequent stage.The primitives that are partially inside the view volume require clipping. And some new vertices will be located at the intersection between the line and the view volume.The advantage of performing the view transformation and projection before clipping is that it makes the clipping problem consistent; primitives are always clipped against the unit cube.Finally, perspective division(division by w) is performed, which places the resulting triangles’ positions into three-dimensional normalized device coordinates.Screen MappingThe coordinates are still three-dimensional when entering this stage.The x- and y-coordinates of each primitive are transformed to form screen coordinates. Screen coordinates together with the z-coordinates are also called window coordinates.The last step in the geometry stage is to convert from NDC to window coordinates.RasterizationRasterization, also called scan conversion, is thus the conversion from two-dimensional vertices in screen space—each with a z-value (depth value) and various shading information asso- ciated with each vertex—into pixels on the screen.Triangle SetupIn this stage the diﬀerentials, edge equations, and other data for the triangle are computed. Fixed- function hardware is used for this task.Triangle TraversalFinding which samples or pixels are inside a triangle is often called triangle traversal.Pixel ProcessingAt this point, all the pixels that are considered inside a triangle or other primitive have been found as a consequence of the combination of all the previous stages.Pixel processing is the stage where per-pixel or per-sample computations and operations are performed on pixels or samples that are inside a primitive.In computer graphics, a sample is an intersection of channel and a pixel.Pixel ShadingThe end product is a color value for each fragment. And this stage is executed by programmable GPU cores. The programmer supplies a program for the fragment shader, which can contain any desired computations.Texturing is employed here.MergingCombine the fragment color produced by the pixel shading stage with the color currently stored in the buﬀer.Unlike the shading stage, the GPU subunit that performs this stage is typically not fully programmable. However, it is highly conﬁgurable, enabling various eﬀects.This stage is also responsible for resolving visibility.Alpha TestStencil BuﬀerFrame BufferIt generally consists of all the buﬀers on a systemDepth TestIt is done with the z-buﬀer algorithm. However, z-buﬀer algorithm cannot be used for partially transparent primitives. These must be rendered after all opaque primitives, and in back-to-front order, or using a separate order-independent algorithm (Section 5.5). Transparency is one of the major weaknesses of the basic z-buﬀer.Double BuﬀerThrough the Pipeline","categories":[],"tags":[{"name":"ComputerGraphics","slug":"ComputerGraphics","permalink":"http://Jinnm.github.io/tags/ComputerGraphics/"}]},{"title":"RealTimeRendering Ch.1","slug":"RealTimeRendering1","date":"2018-09-12T03:27:32.000Z","updated":"2018-09-24T10:46:30.766Z","comments":true,"path":"2018/09/12/RealTimeRendering1/","link":"","permalink":"http://Jinnm.github.io/2018/09/12/RealTimeRendering1/","excerpt":"","text":"Display Rate &amp; Refresh RateDisplay rate is expressed in frames per second(FPS) when refresh rate is expressed in Hertz(Hz). For example, Movie projectors show frames at 24 FPS but use a shutter system to display each frame two to four times to avoid ﬂicker. A shutter that illuminates the frame three times has a 72 Hz refresh rate.","categories":[],"tags":[{"name":"ComputerGraphics","slug":"ComputerGraphics","permalink":"http://Jinnm.github.io/tags/ComputerGraphics/"}]},{"title":"Learn Unity Shader 2","slug":"LearnUnityShader2","date":"2018-09-08T12:11:24.000Z","updated":"2019-03-24T05:33:28.622Z","comments":true,"path":"2018/09/08/LearnUnityShader2/","link":"","permalink":"http://Jinnm.github.io/2018/09/08/LearnUnityShader2/","excerpt":"","text":"Marterial, Shader, TextureMaterial是渲染结果，Shader是渲染过程，方式，Texture是渲染中的一个参数Unity Shader Code StructProperties输入的一些参数SubShaderUnity会调用第一个显卡可用的Shader，且只调用一个，所以高级的SubShader写在前面1SubShader&#123;[Tags][LOD][RenderSetup]Passdef[Passdef...]&#125;Tags: 一般写成以下形式1Tags&#123; &quot;Queue&quot; = &quot;Geometry - 20&quot; &quot;RenderType&quot; = &quot;Opaque&quot; &#125;&emsp;&emsp;下面介绍一下Tags中的Queue和Render Type&emsp;&emsp;Queue: 表示渲染顺序，值越高渲染越后面，叠的越前面&emsp;&emsp;Render Type: 一般用于以下两个函数12Camera.RenderWithShader(Shader shader, string replacementTag);Camera.SetReplacementShader(Shader shader, string replacementTag);LOD: Level of Detail&emsp;&emsp;可以设置支持的最大LOD(shader.maximumLOD),那么有比这个值大的LOD的shader就不会被执行RenderSetup: 一些设定值Pass: 一个pass是一个完整的Graphics Pipeline&emsp;&emsp;UsePass{}: 在其中定义一个name，可让其他shader去抓，达到重复利用的效果&emsp;&emsp;GrabPass{}: 抓取画面中的渲染结果，存到一张贴图，再对它进行一些细节操作，比如玻璃效果、模糊效果1Pass&#123;[Name and Tags][RenderSetup]&#125;&emsp;&emsp;如果在前面的RenderSetup里面写的话，下面的每个Pass都会被套用，在Pass里写就是自己用FallBack所有SubShader都不能用时，当备用Unity Shader CategoryFixed Function Shader不可程式码编辑要用选项式（设定式）完全使用ShaderLab命令支持旧设备用于简单效果Surface Shader可程式码编辑（CGPROGRAM…ENDCG，CG语法）编辑多个Pass编译Vertex Shader，Fragment Shader硬件帮我们封装了很多光影处理细节和光照模式Vertex and Fragment Shader可程式码编辑（CGPROGRAM…ENDCG，CG语法）最灵活弹性，语法最复杂特别的效果（顶点位置改变，部分颜色混合）A Shader Example12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849505152535455565758596061Shader &quot;Custom/Sample&quot;&#123; Properties &#123; _Texture(&quot;Texture&quot;, 2D) = &quot;White&quot; &#123;&#125; _Color(&quot;Color&quot;, Color) = (1,1,1,1) &#125; SubShader &#123; Tags&#123; &quot;Queue&quot; = &quot;Geometry&quot; &quot;RenderType&quot; = &quot;Opaque&quot; &#125; LOD 100 Pass &#123; CGPGOGRAM //CG语言开始 #pragma vertex vert //定义一个VS #pragma fragment frag //定义一个FS sampler2D _Texture; //把输入的东西拿进来 fixed4 _Color; //输入参数的结构 struct appdata&#123; fixed4 vertex : POSITION; //大写的POSITION是个semantics（语义）告诉Unity这个变量的含义是要一个顶点位置 fixed2 uv : TEXCOORD0; //0是第一个uv位置 &#125; //VS到FS参数传递的结构 struct v2f&#123; fixed4 vertex : SV_POSITION; //SV_前缀的变量代表system value，代表最后是到屏幕的坐标值 fixed2 uv : TEXCOORD0; &#125; //vertex shader输入是POSITION，输出是SV_POSITION //开始写方法 v2f vert(appdata i) &#123; v2f o; o.uv = i.uv; //坐标转化MVP(Model-View-Projection) o.vertex = mul(UNITY_MATRIX_MVP, i.vertex); return o; &#125; //FS输出颜色值，所以输出类型是fixed4，SV_Target也是emantics，即渲染目标 fixed4 frag(v2f v) : SV_Target &#123; //将贴图根据uv位置贴上，再跟原来的颜色值做混合 return tex2D(_Texture, v.uv) * _Color; &#125; ENDCG //CG语言结束 &#125; &#125;&#125;","categories":[],"tags":[{"name":"Shader","slug":"Shader","permalink":"http://Jinnm.github.io/tags/Shader/"}]},{"title":"Learn Unity Shader 1","slug":"LearnUnityShader1","date":"2018-09-06T06:24:11.000Z","updated":"2019-03-24T05:33:21.271Z","comments":true,"path":"2018/09/06/LearnUnityShader1/","link":"","permalink":"http://Jinnm.github.io/2018/09/06/LearnUnityShader1/","excerpt":"","text":"大致了解Graphics PipelineMeshMesh是一个点，法向量，面的集合，它定义了一个3D物体的形状（可了解一下Mesh的数据结构）CPU to GPU把数据加载到显存中设置渲染状态调用Draw CallSimple Graphics PipelineHello Triangle这一章首次介绍了Graphics Pipeline， 不过是个简化版$$\\begin{eqnarray}Vertex Data \\quad \\rightarrow \\quad Vertex Shader \\quad \\rightarrow \\quad Shape Assembly \\quad \\rightarrow \\quad Geometry Shader\\end{eqnarray}$$$$\\begin{eqnarray}\\rightarrow \\quad Rasterization \\quad \\rightarrow \\quad Fragment Shader \\quad \\rightarrow \\quad Tests and blending\\end{eqnarray}$$于是去了解了一下详细版本的图形渲染管线Programmable Graphics PipelineApplication Stage物体在应用层，正要把Mesh传入GPU前端输入：Geometry Primitives(图元)&emsp;&emsp;即一到多个顶点、线段、几何体&emsp;&emsp;Vertex Data&emsp;&emsp;包括Vertex position&emsp;&emsp;&emsp;&emsp;Vertex normal vector&emsp;&emsp;&emsp;&emsp;Vertex color&emsp;&emsp;&emsp;&emsp;Texture coordinate(UV)贴图位置输出到GPUGeometry StageVertex Shader:对于输入进来的每个顶点都会调用顶点着色器。它本身不会创建或者销毁任何顶点，而且无法得知顶点间的联系。但是这样的独立性和适合GPU，可以并行处理大量顶点。&emsp;&emsp;包括Operates vertices改变顶点位置&emsp;&emsp;&emsp;&emsp;Vertex transformation(Model-View-Projection)&emsp;&emsp;&emsp;&emsp;Texture coordinate transformations贴图位置转换&emsp;&emsp;&emsp;&emsp;Per-vertex lighting&emsp;&emsp;其中Vertex transformation的流程为：$$\\begin{eqnarray}object/local space \\quad \\underrightarrow{\\text{ modelling transformation }} \\quad world space \\quad \\underrightarrow{\\text{ viewing transformation }}\\end{eqnarray}$$$$\\begin{eqnarray}view/eye space \\quad \\underrightarrow{\\text{ projection transformation }} \\quad clip space\\end{eqnarray}$$&emsp;&emsp;之后在Perspective Frustum(截头视椎体)中做透视除法，将坐标转换到Normalized Device Coordinates(NDC,归一化坐标)中。注意Unity中除了观察空间是右手坐标系之外，其他都是左手坐标系。所以viewing transformation matrix和projection transformation matrix都是会改变空间旋向性的。Primitive Assembly:&emsp;&emsp;把顶点装配成三角形Tessellation Shader:&emsp;&emsp;图元细分，是可选项Geometry Shader:&emsp;&emsp;几何着色器，也是可选项。基本做的是顶点的增减，性能较差因为不像VS和FS那样高度并行。是继VS、FS之后，由Shader Model 4（第四代显卡着色架构）正式引入的第三个着色器。具体可参考Refrence第三条。Clipping:&emsp;&emsp;把NDC之外的剔除Screen Mapping:&emsp;&emsp;3D的点转化到2DRasterization StageRasterization &amp; Interpolation:&emsp;&emsp;把三角形的区域变成一片一片的fragment 以及 对颜色渐变做差值运算Fragment Shader:&emsp;&emsp;输入一片一片的fragment，对每个fragment进行着色&emsp;&emsp;texture mapping：把贴图根据UV的位置贴上来Raster Operation:&emsp;&emsp;光栅操作，各种测试&emsp;&emsp;Early-Z：把Depth test提前到fragment前，节省FS需要处理的片元&emsp;&emsp;Double Buffering：一个buffer正在用于屏幕绘制，一个buffer正在被写入数据Reference1、https://www.youtube.com/watch?v=fhmf5PacfVg&amp;list=PLxMD5A4JpjsouiyE14Jag6TceLeJyIZ7h2、https://learnopengl-cn.github.io/3、http://gad.qq.com/article/detail/147184、Unity Shader入门精要（看过这本书之后对这篇博文做了补充和修改）","categories":[],"tags":[{"name":"Shader","slug":"Shader","permalink":"http://Jinnm.github.io/tags/Shader/"}]},{"title":"场景设计与表现","slug":"changjingsheji","date":"2018-08-22T13:22:53.000Z","updated":"2018-11-06T02:16:02.292Z","comments":true,"path":"2018/08/22/changjingsheji/","link":"","permalink":"http://Jinnm.github.io/2018/08/22/changjingsheji/","excerpt":"","text":"这是一门专业必修课的作业。故事背景：在经历大型陨石雨的毁灭性打击后，吉祥寺院因所处地形奇特而免受打击，其中的僧人幸运的活了下来，然而由于旁边可以采购食品、日用品的小镇不复存在，僧人们只好另寻他处，并建立了新的基地，这个基地除了寺庙之外，还包括食物系统、水资源系统、交通运输系统、防御系统。","categories":[],"tags":[{"name":"other","slug":"other","permalink":"http://Jinnm.github.io/tags/other/"}]},{"title":"Game || Beautifnl World","slug":"Game-Beautifnl-World","date":"2018-08-07T16:13:21.000Z","updated":"2018-09-05T04:15:48.784Z","comments":true,"path":"2018/08/08/Game-Beautifnl-World/","link":"","permalink":"http://Jinnm.github.io/2018/08/08/Game-Beautifnl-World/","excerpt":"","text":"It’s a game made at NUS Summer Workshop.The game’s name isn’t a spelling mistake. There is an “end” in the game’s name.Our hero is a character in a game where the server is going to be shut down. But his last player, a girl, gives him the courage to escape from the game world. In this process he is going to overcome obstacles and unlock puzzles, then he will find his destiny.Click https://jinnm.github.io/Group04Final/ to play!","categories":[],"tags":[{"name":"Game","slug":"Game","permalink":"http://Jinnm.github.io/tags/Game/"}]},{"title":"设计 || 一些意义特殊的平面设计","slug":"design3","date":"2018-08-07T14:21:40.000Z","updated":"2019-03-30T13:01:01.633Z","comments":true,"path":"2018/08/07/design3/","link":"","permalink":"http://Jinnm.github.io/2018/08/07/design3/","excerpt":"","text":"一晃两年过去了，总结一下这两年中一些意义特殊的平面设计翻看文件夹时不由的感叹，很多当时看着还不错的海报，现在看来……都不好意思拿出手了第一个是我刚进大学面试学生会做的作业，主题是舒服，然后我做了一张批判舒适的海报（当时的脑回路好清奇啊），最后的面试是失败了，不过当时面试官的有些话对之后的我影响很大。第二个是工业设计协会时期，第一次不为任务而做宣传品，类似于自己的练习吧，可以自由选择想要介绍的东西，不过云马的文案是乱写的emmm第三个是社团联创意与设计中心（简称创设）的logo，也是我第一次做logo，右上角四个图案为“创”，左下角四个图案为“设”，黄色是部门的主题色啦第四个是选择大二继续在社团联留一年后做的纳新海报，大一一整年都觉得自己不会选择留下来，结果等到真的要分别的时候突然感觉舍不得。最后一个是这辈子做过最快的海报，因为是突然得知消息说小游戏的展示需要海报，于是花了五分钟把图和字扔上去然后光速打印……这是第一次给自己的产品做海报","categories":[],"tags":[{"name":"Design","slug":"Design","permalink":"http://Jinnm.github.io/tags/Design/"}]},{"title":"设计 || 晚会门票","slug":"design1","date":"2018-05-26T02:16:46.000Z","updated":"2019-03-30T13:00:12.809Z","comments":true,"path":"2018/05/26/design1/","link":"","permalink":"http://Jinnm.github.io/2018/05/26/design1/","excerpt":"","text":"社团建设月闭幕式是晚会的形式，晚会上将会有优秀社团的演出，与各大社团奖项的颁发，还有一个特别的环节——优秀社团人分享。本次建设月闭幕式的主题是毕业季，甲方给我们的设计关键词有纸飞机、白鸽等这些放飞希望的象征。海报已经差不多定稿，见下图。这次接到的锅是门票设计，初衷是设计一款令人印象深刻的门票。考虑到自己去看晚会时，门票拿在手里会折来折去，这次的设计关键词又有纸飞机，于是决定设计一款可以折叠成纸飞机的门票。门票上会设计好折痕，并在折痕边标注折这一步的序号。同时注意与海报风格相统一。","categories":[],"tags":[{"name":"Design","slug":"Design","permalink":"http://Jinnm.github.io/tags/Design/"}]},{"title":"About Me","slug":"About-me","date":"2018-04-29T05:25:13.000Z","updated":"2018-11-06T02:02:52.656Z","comments":true,"path":"2018/04/29/About-me/","link":"","permalink":"http://Jinnm.github.io/2018/04/29/About-me/","excerpt":"","text":"数字媒体技术16级本科浙江舟山人处女座瑞克和莫蒂粉丝权力的游戏粉丝进击的巨人粉丝喜欢一切好看的东西喜欢DianYin(g)喜欢收集表情包喜欢科幻奇幻大片喜欢宇宙飞船喜欢奇异世界漫威粉丝其中最喜欢变种人其中最喜欢死侍皮克斯粉丝其中最喜欢…很难说喜欢折腾自己的电脑喜欢不断的搜索未知事物这两件事让我电脑前趴一天梦想是成为一个会代码的设计师反过来也行！网站的logo是名字缩写JM拼成的雨伞~","categories":[],"tags":[{"name":"other","slug":"other","permalink":"http://Jinnm.github.io/tags/other/"}]}]}